export const constant = {
    EMPTY_OR_BLANK_REGEX: /^\s*$/,
    USERNAME_REGEX: /^[a-zA-Z0-9._]+$/,
    EMAIL_REGEX: /^(([^<>()[\]\.,;:\s@\"]+(\.[^<>()[\]\.,;:\s@\"]+)*)|(\".+\"))@(([^<>()[\]\.,;:\s@\"]+\.)+[^<>()[\]\.,;:\s@\"]{2,})$/i,
    NAME_REGEX: /^[A-ZÁÉÍÓÚÑa-záéíóúñ]+(?:[\s'-][A-ZÁÉÍÓÚÑa-záéíóúñ]+)*$/,
    LASTNAME_REGEX: /^[A-ZÁÉÍÓÚÑa-záéíóúñ]+(?:[\s'-][A-ZÁÉÍÓÚÑa-záéíóúñ]+)*$/,
    URL_REGEX: /https?:\/\/(www\.)?[-a-zA-Z0-9@:%._\+~#=]{1,256}\.[a-zA-Z0-9()]{1,6}\b([-a-zA-Z0-9()@:%_\+.~#?&//=]*)/
}